import os
import json


save_exp_dir = "exp/"
dataset_name = "mlqa/vi"
save_config_dir = os.path.join(save_exp_dir, dataset_name, "configs")
os.makedirs(save_config_dir, exist_ok=True)
gen_args = {
    "model_name": "mistral-large-latest",
    "system_prompt": "आप एक एआई सहायक हैं जो हिंदी बोलते हैं।",
    "user_prompt": 'आपको प्रश्न के उत्तर की गुणवत्ता का मूल्यांकन करने की आवश्यकता है। आपको दिया गया है: एक प्रश्न, एक ग्राउंड ट्रुथ उत्तर जो निश्चित रूप से सही है, और एक जेनरेटेड उत्तर जिसे आपको 1 या 0 पर रेट करना होगा। 1 की रेटिंग का मतलब है कि उत्तर सही है, 0 की रेटिंग का मतलब है कि उत्तर गलत है। आपको जेनरेटेड उत्तर की तुलना ग्राउंड ट्रुथ उत्तर से करनी होगी, जिसमें प्रश्न को ही ध्यान में रखा गया हो। ग्राउंड ट्रुथ उत्तर और जेनरेटेड उत्तर अलग-अलग लंबाई के हो सकते हैं और उनमें अलग-अलग मात्रा में जानकारी हो सकती है, इसलिए विचार करें कि क्या उत्तर प्रश्न से प्रश्नवाचक शब्द को दिया गया है: यदि प्रश्न में "कौन" पूछा गया है, तो जेनरेटेड उत्तर में किसी व्यक्ति, चरित्र या जानवर का नाम होना चाहिए; यदि प्रश्न में "कितने" पूछा गया है, तो उत्तर में कोई संख्या होनी चाहिए। उदाहरण 1: प्रश्न: "हॉट डांस क्लब सॉन्ग्स चार्ट पर एवरीबॉडी किस स्थान पर है?" ग्राउंड ट्रुथ उत्तर: "हॉट डांस क्लब सॉन्ग्स चार्ट पर एवरीबॉडी तीसरे स्थान पर पहुँच गया है।" जेनरेटेड उत्तर: "तीसरा स्थान।" मॉडल स्कोर: 1 उदाहरण 2: प्रश्न: "किस क्षेत्र में बहुत अधिक आबादी वाले गाँव हैं?" जमीनी सच्चाई का जवाब: "कोल्चिस की भूमि के क्षेत्र में।" उत्पन्न उत्तर: "इस क्षेत्र में कई घनी आबादी वाले गांव हैं।" मॉडल स्कोर: 0 उदाहरण 3: प्रश्न: "रोम का इतिहास कितने खंडों में प्रकाशित हुआ है?" जमीनी सच्चाई का जवाब: "रोम का इतिहास चार खंडों में प्रकाशित हुआ है।" उत्पन्न उत्तर: "उत्तर: तीन खंडों में।" मॉडल स्कोर: 0 उदाहरण 4: प्रश्न: "माइकल एंजेलो का सिर किस तरह का था?" जमीनी सच्चाई का जवाब: "माइकल एंजेलो का सिर गोल था।" उत्पन्न उत्तर: "माइकल एंजेलो का सिर गोल था, उसका माथा चौकोर, झुर्रीदार और स्पष्ट भौंहों वाला था।" मॉडल स्कोर: 1',
    "assistant_prompt": None,
    "gen_config": {}
}
json.dump(gen_args, open(os.path.join(save_config_dir, "gen_args.json"), "w"))